-- вставка данных в таблицу (insert)
-- вставка данных в таблицу (insert)
INSERT INTO pupils (surname, name, fathername, gender, nationality, height, weight, birthdate, phonenumber, homeaddress, grade)
VALUES 	('Владов','Илья','Макарович','м','украинец',165,34,'2002.12.03','+375291234678','ул.Сморина,12-34',7),
		('Вилонов','Адам','Алексеевич','м','россиянин',132,29,'2005.11.04','+375291114628','ул.Сморина,11-103',3),
		('Лимова','Анна','Алексеевна','ж','белоруска',150,40,'2003.03.07','+375291072938','ул.Сморина,12-13',5),
		('Актемин','Илья','Михайлович','м','россиянин',170,34,'2002.11.03','+375299999678','ул.Сморина,10-4',7),
		('Валов','Андрей','Алексеевич','м','россиянин',127,29,'2005.11.04','+375291114698','ул.Сурганова,11-103',3),
		('Тумова','Мария','Алексасндровна','ж','белоруска',174,59,'2000.03.07','+375292372938','ул.Одоевского,1-13',5),
		('Тумова','Марь','Алексасндровна','ж','белоруска',180,60,'2000.03.07','+375292372938','ул.Одоевского,1-13',9),
		('Тумова','Марья','Алексасндровна','ж','белоруска',180,60,'2000.03.07','+375292372938','ул.Одоевского,1-13',9),
		('Вилонова','Ада','Алексеевна','ж','россиянка',120,29,'2002.11.04','+375291334628','ул.Сморина,11-103',2),
		('Лимова','Алеся','Алексеевна','ж','белоруска',120,30,'2003.09.07','+375297072938','ул.Сморина,12-13',3);

-- обновление данных с использованием update
UPDATE pupils SET grade = 2 WHERE surname = 'Валов';

-- удаление строк по id и по названию объекта
DELETE FROM pupils WHERE id = 8;
DELETE FROM pupils WHERE name = 'Марь';
 
INSERT INTO school (id, sch_name, sch_description)
VALUES (312,'High Klementon','High Klementon for High grates!'),
       (1290,'HS Cherryton', 'For cool kids'),
       (10, '№ 10' ,'Everage high school'),
       (5, '№ 5' ,'Everage middle school');

UPDATE pupils SET school_id = 1290 	WHERE grade = 5;
UPDATE pupils SET school_id = 5 	WHERE grade = 3;
UPDATE pupils SET school_id = 312 	WHERE grade = 7;
